job/tasks/headers

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:RailEuropeWebService="http://soap.ws.web.raileurope.com" xmlns:ax21="soap.ws.web.raileurope.com" xsl:version="1.0">
  <soap:Body>
    <RailEuropeWebService:doBuildItinerary>
      <RailEuropeWebService:key>CHANGE_ME_USD</RailEuropeWebService:key>
      <RailEuropeWebService:locale>en_US</RailEuropeWebService:locale>
      <RailEuropeWebService:style></RailEuropeWebService:style>
      <RailEuropeWebService:travelAgency>
        <ax21:agencyType></ax21:agencyType>
        <ax21:agencyId></ax21:agencyId>
      </RailEuropeWebService:travelAgency>
      <RailEuropeWebService:originCityName></RailEuropeWebService:originCityName>
      <RailEuropeWebService:destinationCityName></RailEuropeWebService:destinationCityName>
      <RailEuropeWebService:originCityCode>%s</RailEuropeWebService:originCityCode>
      <RailEuropeWebService:destinationCityCode>%s</RailEuropeWebService:destinationCityCode>
      <RailEuropeWebService:originStationCode></RailEuropeWebService:originStationCode>
      <RailEuropeWebService:destinationStationCode></RailEuropeWebService:destinationStationCode>
      <RailEuropeWebService:viaCityCode></RailEuropeWebService:viaCityCode>
      <RailEuropeWebService:viaStationCode></RailEuropeWebService:viaStationCode>
      <RailEuropeWebService:alternateInventorySelection></RailEuropeWebService:alternateInventorySelection>
      <RailEuropeWebService:directTrainsOnly></RailEuropeWebService:directTrainsOnly>
      <RailEuropeWebService:departureDate>%s</RailEuropeWebService:departureDate>
      <RailEuropeWebService:departureTime>
        <ax21:low>00:00</ax21:low>
        <ax21:high>23:00</ax21:high>
      </RailEuropeWebService:departureTime>
    </RailEuropeWebService:doBuildItinerary>
  </soap:Body>
</soap:Envelope>
